// lab8_v2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include "TestArray.h"

int main()
{
	size_t const Nmin = 256;
	size_t const Nmax = 32 * 1024 * 1024 / 4;
	size_t K = 100;
	TestArray frontTrav(Nmax, Nmin, K, FRONT);
	frontTrav.Test();
	TestArray backTrav(Nmax, Nmin, K, BACK);
	backTrav.Test();
	TestArray randTrav(Nmax, Nmin, K, RAND);
	randTrav.Test();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
